---
title: Generic
classe: Autodesk.Revit.DB.Visual.Generic
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 19
---

# Generic

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String ColorByObject { get; }` | `Generic.ColorByObject` | String |
| `String CommonTintColor { get; }` | `Generic.CommonTintColor` | String |
| `String CommonTintToggle { get; }` | `Generic.CommonTintToggle` | String |
| `String GenericBumpAmount { get; }` | `Generic.GenericBumpAmount` | String |
| `String GenericBumpMap { get; }` | `Generic.GenericBumpMap` | String |
| `String GenericCutoutOpacity { get; }` | `Generic.GenericCutoutOpacity` | String |
| `String GenericDiffuse { get; }` | `Generic.GenericDiffuse` | String |
| `String GenericDiffuseImageFade { get; }` | `Generic.GenericDiffuseImageFade` | String |
| `String GenericGlossiness { get; }` | `Generic.GenericGlossiness` | String |
| `String GenericIsMetal { get; }` | `Generic.GenericIsMetal` | String |
| `String GenericReflectivityAt0deg { get; }` | `Generic.GenericReflectivityAt0deg` | String |
| `String GenericReflectivityAt90deg { get; }` | `Generic.GenericReflectivityAt90deg` | String |
| `String GenericRefractionIndex { get; }` | `Generic.GenericRefractionIndex` | String |
| `String GenericRefractionTranslucencyWeight { get; }` | `Generic.GenericRefractionTranslucencyWeight` | String |
| `String GenericSelfIllumColorTemperature { get; }` | `Generic.GenericSelfIllumColorTemperature` | String |
| `String GenericSelfIllumFilterMap { get; }` | `Generic.GenericSelfIllumFilterMap` | String |
| `String GenericSelfIllumLuminance { get; }` | `Generic.GenericSelfIllumLuminance` | String |
| `String GenericTransparency { get; }` | `Generic.GenericTransparency` | String |
| `String GenericTransparencyImageFade { get; }` | `Generic.GenericTransparencyImageFade` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```